# Core CLI tools
brew "btop"
brew "fzf"
brew "gh"
brew "git-lfs"
brew "git-secrets"
brew "htop"
brew "jq"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "wget"
brew "yazi"
brew "zellij"

# Languages / runtimes (managed separately via nvm/pyenv, but useful as fallback)
# Amazon Corretto — opensearch/sql builds & tests against JDK 21 and 25.
# Casks install into /Library/Java/JavaVirtualMachines (require sudo on install).
cask "corretto@21"
cask "corretto@25"

# Container tools
brew "colima"
brew "docker", link: false
brew "act"

# Other
brew "graphviz"
brew "sbt"
brew "unison"

# Casks (macOS GUI apps)
cask "docker-desktop"
